<a href="https://colab.research.google.com/github/swaleha/Python/blob/master/Swaleha_Programming_drill_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Drill

#### Dataset used here contains a subset of information, pertaining to the weather patterns for 4 specific days in the city of New York, Mumbai and Paris. 
#### Content: City, temperature, windspeed and event along with dates.

In [21]:
# IMPORTING DATASETS

import io
import pandas as pd
url ='https://raw.githubusercontent.com/swaleha/Python/master/weather_data_cities.csv'
df = pd.read_csv(url)
df.head() # first five rows of the data

# df.tail() for last five rows of the days

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

# #DRILL 1

Basic Operations to Understand the Data


<img src="https://drive.google.com/uc?id=1n6Ui4m0lqhhQsCZSgIjyvUIt2exIxPC_" width="700">

### Expected Output
<img src="https://drive.google.com/uc?id=1pCU6V01YPszJ4jgK-tcGrQg9h4L9z287" width="700">

In [16]:
print(df.shape)

print('-'*80)

print(df[3:8])

print('-'*80)

print(df.columns)

print('-'*80)

print(df[['day', 'event']])

print('-'*80)

print(df['temperature'].max())

print('-'*80)

df[df['temperature'] == df['temperature'].max()]

(12, 5)
--------------------------------------------------------------------------------
        day      city  temperature  windspeed  event
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
5  1/2/2017    mumbai           85         12    Fog
6  1/3/2017    mumbai           87         15    Fog
7  1/4/2017    mumbai           92          5   Rain
--------------------------------------------------------------------------------
Index(['day', 'city', 'temperature', 'windspeed', 'event'], dtype='object')
--------------------------------------------------------------------------------
         day   event
0   1/1/2017    Rain
1   1/2/2017   Sunny
2   1/3/2017    Snow
3   1/4/2017   Sunny
4   1/1/2017   Sunny
5   1/2/2017     Fog
6   1/3/2017     Fog
7   1/4/2017    Rain
8   1/1/2017   Sunny
9   1/2/2017  Cloudy
10  1/3/2017  Cloudy
11  1/4/2017  Cloudy
--------------------------------------------------------------------------------
92
--------------------------------------------------------------------------------

        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  Rain

# #DRILL 2

Using GROUP-BY


<img src="https://drive.google.com/uc?id=1evGK9rsU2Kb5fF1ELOa71p5X9GlW8l14" width="700">

### Expected Output
<img src="https://drive.google.com/uc?id=1ZQFODLlURAN4IV2oCxjxlkNmqdBzAVaz" width="700">

In [19]:
g = df.groupby('city')

for city, city_df in g:
  print(city)
  print(city_df)

print('-'*80)

print(g.get_group('new york'))

print('-'*80)

print(g.max())

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
--------------------------------------------------------------------------------
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
--------------------------------------------------------------------------------
               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

# #DRILL 3

Concatenate Data Frames




<img src="https://drive.google.com/uc?id=1NbVL2FPmFztREzrDl5lWho3ietuhDH4u" width="700">

### Expected Output
<img src="https://drive.google.com/uc?id=10zDsD9v17rc-9b1nqcyiZ_sRcTH8bB8D" width="700">

In [26]:
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78]
})

print(india_weather)

print('-'*80)

us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35] ,
    "humidity": [68, 65, 75]
})

print(us_weather)

print('-'*80)
df = pd.concat([india_weather, us_weather], ignore_index = True)
print(df)

print('-'*80)
df = pd.concat([india_weather, us_weather], axis = 1)
print(df)

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
--------------------------------------------------------------------------------
       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75
--------------------------------------------------------------------------------
        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75
--------------------------------------------------------------------------------
        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           21        68
1      delhi           45        60   chicago           14        65
2  bangalore           30        78   orlando           35        75

# #DRILL 4

Numerical Indexing (.loc, iloc)


<img src="https://drive.google.com/uc?id=1WmLg9tSbJCRhRI7JJFO-YNdzO7rMWUeq" width="700">

### Expected Output
<img src="https://drive.google.com/uc?id=1SwklAOwoFO-rsSHyDR291bA2HnHB2GTS" width="700">

In [29]:
df = pd.DataFrame([3, 4, 5, 6, 7, 8], index = [47, 46, 45, 1, 2, 3])
print(df)

print('-'*80)
print(df.loc[:2])

print('-'*80)
print(df.iloc[:2])

print('-'*80)
print(df.loc[45])

    0
47  3
46  4
45  5
1   6
2   7
3   8
--------------------------------------------------------------------------------
    0
47  3
46  4
45  5
1   6
2   7
--------------------------------------------------------------------------------
    0
47  3
46  4
--------------------------------------------------------------------------------
0    5
Name: 45, dtype: int64